## One Hot Encoding

**One hot encoding**  is one of the most common encoding methods in machine learning. This method spreads the values in a column to multiple flag columns and assigns 0 or 1 to them. These binary values express the relationship between grouped and encoded column.

This method changes your categorical data, which is challenging to understand for algorithms, to a numerical format and enables you to group your categorical data without losing any information.

![alt text](https://miro.medium.com/max/1400/1*ZX99GOZ6-9_yJg6rZchTEA.png)


**Why One-Hot?**: If you have N distinct values in the column, it is enough to map them to N-1 binary columns, because the missing value can be deducted from other columns. If all the columns in our hand are equal to 0, the missing value must be equal to 1. This is the reason why it is called as one-hot encoding.

In [0]:
import pandas as pd
import numpy as np

In [0]:
data = pd.read_csv('/content/housing.csv')

In [3]:
data.head()

   longitude  latitude  ...  median_house_value  ocean_proximity
0    -122.23     37.88  ...            452600.0         NEAR BAY
1    -122.22     37.86  ...            358500.0         NEAR BAY
2    -122.24     37.85  ...            352100.0         NEAR BAY
3    -122.25     37.85  ...            341300.0         NEAR BAY
4    -122.25     37.85  ...            342200.0         NEAR BAY

[5 rows x 10 columns]

In [4]:
data['ocean_proximity']

0        NEAR BAY
1        NEAR BAY
2        NEAR BAY
3        NEAR BAY
4        NEAR BAY
           ...
20635      INLAND
20636      INLAND
20637      INLAND
20638      INLAND
20639      INLAND
Name: ocean_proximity, Length: 20640, dtype: object

In [5]:
data['ocean_proximity'].unique()

array(['NEAR BAY', '<1H OCEAN', 'INLAND', 'NEAR OCEAN', 'ISLAND'],
      dtype=object)

In [0]:
encoded_columns = pd.get_dummies(data['ocean_proximity'])
data = data.join(encoded_columns).drop('ocean_proximity', axis=1)

In [7]:
data.head()

   longitude  latitude  housing_median_age  ...  ISLAND  NEAR BAY  NEAR OCEAN
0    -122.23     37.88                41.0  ...       0         1           0
1    -122.22     37.86                21.0  ...       0         1           0
2    -122.24     37.85                52.0  ...       0         1           0
3    -122.25     37.85                52.0  ...       0         1           0
4    -122.25     37.85                52.0  ...       0         1           0

[5 rows x 14 columns]

We can see that the 'ocean_proximity' column gets divided into 5 columns.

In [18]:
data.iloc[:,9:15]

       <1H OCEAN  INLAND  ISLAND  NEAR BAY  NEAR OCEAN
0              0       0       0         1           0
1              0       0       0         1           0
2              0       0       0         1           0
3              0       0       0         1           0
4              0       0       0         1           0
...          ...     ...     ...       ...         ...
20635          0       1       0         0           0
20636          0       1       0         0           0
20637          0       1       0         0           0
20638          0       1       0         0           0
20639          0       1       0         0           0

[20640 rows x 5 columns]